package x.mvmn.games.tetris.oopexamples.графіка.фігури;

import x.mvmn.games.tetris.oopexamples.графіка.допоміжне.Графіка;
import x.mvmn.games.tetris.oopexamples.графіка.допоміжне.Координати;

import java.awt.Color;

public class Прямокутник extends ГеомертичнаФігура {

    private final Координати ліваВерхняТочка;

    private final Координати праваНижняТочка;
    protected Пряма[] лінії = new Пряма[4];

    public Прямокутник(Координати ліваВерхняТочка, Координати праваНижняТочка) {
        this.ліваВерхняТочка = ліваВерхняТочка;
        this.праваНижняТочка = праваНижняТочка;
        задатиЛінії();
    }

    public Прямокутник(Координати ліваВерхняТочка, Координати праваНижняТочка, Color колір) {
        this(ліваВерхняТочка, праваНижняТочка);
        setКолір(колір);
    }

    protected void задатиЛінії() {
        лінії[0] = new Пряма(new Координати(ліваВерхняТочка.getX(), ліваВерхняТочка.getY()), new Координати(праваНижняТочка.getX(), ліваВерхняТочка.getY()));
        лінії[1] = new Пряма(new Координати(праваНижняТочка.getX(), ліваВерхняТочка.getY()), new Координати(праваНижняТочка.getX(), праваНижняТочка.getY()));
        лінії[2] = new Пряма(new Координати(ліваВерхняТочка.getX(), ліваВерхняТочка.getY()), new Координати(ліваВерхняТочка.getX(), праваНижняТочка.getY()));
        лінії[3] = new Пряма(new Координати(ліваВерхняТочка.getX(), праваНижняТочка.getY()), new Координати(праваНижняТочка.getX(), праваНижняТочка.getY()));
    }

    @Override
    public void setКолір(Color колір) {
        super.setКолір(колір);
        for (Пряма лінія : лінії) {
            лінія.setКолір(колір);
        }
    }

    @Override
    public void намалювати(Графіка графіка) {
        for (Пряма лінія : лінії) {
            лінія.намалювати(графіка);
        }
    }

    @Override
    public String toString() {
        return this.getClass().getSimpleName() + " (" + ліваВерхняТочка + " - " + праваНижняТочка + "), колір " + колір.getRed() + "/" + колір.getGreen() + "/" + колір.getBlue();
    }
}
