package x.mvmn.games.tetris.oop.модель;

public class СтанГри {

    protected int рівень = 0;
    protected int рахунок = 0;
    protected int поточнаКількістьРядківДоНаступногоРівня;
    protected ПоточнаФігура поточнаФігура;
    protected СтанПоляТетрісу станПоля = new СтанПоляТетрісу();

    public void скинутиСтан() {
        станПоля.скинути();
        поточнаФігура = null;
        рівень = 0;
        рахунок = 0;
        поточнаКількістьРядківДоНаступногоРівня = 10;
    }

    public int рівень() {
        return рівень;
    }

    public void збільшитиРівень() {
        this.рівень++;

        рахунок += 100 * рівень;
        поточнаКількістьРядківДоНаступногоРівня = 10;
    }

    public int рахунок() {
        return рахунок;
    }

    public void приЗаповненніРядків(int кількістьРядків) {
        if (кількістьРядків > 0) {
            this.рахунок += (рівень + 1) * 10 * кількістьРядків;
            поточнаКількістьРядківДоНаступногоРівня -= кількістьРядків;
            if (поточнаКількістьРядківДоНаступногоРівня < 0) {
                поточнаКількістьРядківДоНаступногоРівня += 10;
                збільшитиРівень();
            }
        }
    }

    public ПоточнаФігура поточнаФігура() {
        return поточнаФігура;
    }

    public void поточнаФігура(ПоточнаФігура поточнаФігура) {
        this.поточнаФігура = поточнаФігура;
    }

    public СтанПоляТетрісу станПоля() {
        return станПоля;
    }

    public int рядківДоНаступногоРівня() {
        return поточнаКількістьРядківДоНаступногоРівня;
    }
}
