package x.mvmn.games.tetris.сервіс;

import x.mvmn.games.tetris.відображення.ГоловнеВікно;
import x.mvmn.games.tetris.відображення.КомпонентПолеТетрісу;
import x.mvmn.games.tetris.відображення.КомпонентЧисловийІндикатор;
import x.mvmn.games.tetris.модель.ПоточнаФігура;
import x.mvmn.games.tetris.модель.СтанГри;
import x.mvmn.games.tetris.модель.фігури.Фігура;

public class РушійГри implements СлухачВводуКористувача {

  protected СтанГри станГри = new СтанГри();
  protected boolean граЙде = false;
  protected boolean попросилиВихід = false;
  protected КомпонентПолеТетрісу поле;
  protected ГоловнеВікно головнеВікно;
  protected КомпонентЧисловийІндикатор рахунок;
  protected КомпонентЧисловийІндикатор рівень;
  protected ФабрикаФігур фабрикаФігур = new ФабрикаФігур();
  private static final int повільністьПочатковогоРівня = 50;
  protected int кроківДоПониженняФігури = повільністьПочатковогоРівня;

  public РушійГри(ГоловнеВікно головнеВікно) {
    this.головнеВікно = головнеВікно;

    this.поле = new КомпонентПолеТетрісу(станГри.станПоля());
    this.рахунок = new КомпонентЧисловийІндикатор("Рахунок: ", 422, 8, 370, 40, 8, 24);
    this.рівень = new КомпонентЧисловийІндикатор("Рівень: ", 422, 58, 370, 40, 8, 24);

    головнеВікно.додатиКомпонент(поле);
    головнеВікно.додатиКомпонент(рахунок);
    головнеВікно.додатиКомпонент(рівень);
  }

  @Override
  public void натиснутоПробіл() {
    граЙде = true;
  }

  @Override
  public void натиснутоВліво() {
    if (граЙде) {
      int x = станГри.поточнаФігура().x();
      if (x > 0 && !станГри.станПоля().колізія(станГри.поточнаФігура().фігура(), x - 1,
          станГри.поточнаФігура().y())) {
        станГри.поточнаФігура().x(x - 1);
      }
    }
  }

  @Override
  public void натиснутоВправо() {
    if (граЙде) {
      int x = станГри.поточнаФігура().x();
      if (x + станГри.поточнаФігура().фігура().ширина() < 10 && !станГри.станПоля()
          .колізія(станГри.поточнаФігура().фігура(), x + 1, станГри.поточнаФігура().y())) {
        станГри.поточнаФігура().x(x + 1);
      }
    }
  }

  @Override
  public void натиснутоВгору() {
    if (граЙде) {
      Фігура фігура = станГри.поточнаФігура().фігура();
      int x = станГри.поточнаФігура().x() + фігура.зміщенняОбертуX();
      int y = станГри.поточнаФігура().y() + фігура.зміщенняОбертуY();
      фігура = фігура.обернути();
      if (x < 0) {
        x = 0;
      }
      if (x + 1 + фігура.ширина() > 10) {
        x = 10 - фігура.ширина();
      }
      if (y < 0) {
        y = 0;
      }
      if (y + 1 + фігура.висота() > 15) {
        y = 15 - фігура.висота();
      }

      if (!станГри.станПоля().колізія(фігура, x, y)) {
        станГри.поточнаФігура().фігура(фігура);
        станГри.поточнаФігура().x(x);
        станГри.поточнаФігура().y(y);
      }
    }
  }

  @Override
  public void натиснутоДонизу() {
    if (граЙде) {
      пониженняФігури();
    }
  }

  @Override
  public void натиснутоВихід() {
    попросилиВихід = true;
  }

  public void запуск() {
    while (!попросилиВихід) {
      передПочатокГри();
      поле.текст("Натисніть ПРОБІЛ щоб почати");
      while (!граЙде) {
        Thread.yield();
      }
      while (граЙде && !попросилиВихід) {
        поле.текст(null);
        крокГри();
        try {
          Thread.sleep(10);
        } catch (InterruptedException e) {
          break;
        }
      }
    }
  }

  private void крокГри() {
    if (станГри.поточнаФігура() == null) {
      наступнаФігура();
    }

    кроківДоПониженняФігури--;
    if (кроківДоПониженняФігури <= 0) {
      пониженняФігури();
    }

    головнеВікно.перемалюватиВміст();
  }

  private void передПочатокГри() {
    кроківДоПониженняФігури = повільністьПочатковогоРівня;
    станГри.скинутиСтан();
    рахунок.стан(0);
    рівень.стан(0);
    поле.поточнаФігура(null);
  }

  private void наступнаФігура() {
    станГри.поточнаФігура(new ПоточнаФігура(фабрикаФігур.створитиВипадковуФігуру()));
    поле.поточнаФігура(станГри.поточнаФігура());
  }

  private void пониженняФігури() {
    кроківДоПониженняФігури = Math.max(0, повільністьПочатковогоРівня - станГри.рівень() * 5);

    if ((станГри.поточнаФігура().y() + станГри.поточнаФігура().фігура().висота() >= 15)
        || станГри.станПоля().колізія(станГри.поточнаФігура().фігура(), станГри.поточнаФігура().x(),
            станГри.поточнаФігура().y() + 1)) {
      int заповненіРядки = станГри.станПоля().приземлитиФігуру(станГри.поточнаФігура());
      if (заповненіРядки > 0) {
        станГри.приЗаповненніРядків(заповненіРядки);
        рахунок.стан(станГри.рахунок());
        рівень.стан(станГри.рівень());
      }
      наступнаФігура();
      if (станГри.станПоля().колізія(станГри.поточнаФігура().фігура(), станГри.поточнаФігура().x(),
          станГри.поточнаФігура().y())) {
        граЙде = false; // Програш
        поле.текст("Натисніть ПРОБІЛ щоб почати");
      }
    } else {
      станГри.поточнаФігура().y(станГри.поточнаФігура().y() + 1);
    }
  }
}
